透视表是一种可以对数据动态排布并且分类汇总的表格格式

In [1]:
import pandas as pd

In [2]:
example = pd.DataFrame({'Month': ["January", "January", "January", "January", 
                                     "Feburary", "Feburary", "Feburary", "Feburary",
                                     "March", "March", "March", "March"],
                          'Category':["Transportation", "Grocery", "Household", "Entertainment",
                                     "Transportation", "Grocery", "Household", "Entertainment",
                                     "Transportation", "Grocery", "Household", "Entertainment"],
                          'Amount':[74, 235, 175, 100, 115, 240, 225, 125, 90, 260, 200, 120]})
example

    Amount        Category     Month
0       74  Transportation   January
1      235         Grocery   January
2      175       Household   January
3      100   Entertainment   January
4      115  Transportation  Feburary
5      240         Grocery  Feburary
6      225       Household  Feburary
7      125   Entertainment  Feburary
8       90  Transportation     March
9      260         Grocery     March
10     200       Household     March
11     120   Entertainment     March

#### 用pivot做统计

* 以Category为行(index)
* 以Month为列(columns)
* 对Amount进行统计

In [6]:
example_pivot = example.pivot_table(index = 'Category', 
                                                            columns = 'Month', 
                                                            values = 'Amount')
example_pivot

Month           Feburary  January  March
Category
Entertainment        125      100    120
Grocery              240      235    260
Household            225      175    200
Transportation       115       74     90

对行求和

In [7]:
example_pivot.sum(axis=1)

Category
Entertainment     345
Grocery           735
Household         600
Transportation    279
dtype: int64

对列求和

In [9]:
example_pivot.sum()

Month
Feburary    705
January     584
March       670
dtype: int64

#### 分析泰坦尼克号数据

In [11]:
df=pd.read_csv('./data/titanic.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

查看不同性别乘客的仓位票价   
默认求values的平均值

In [13]:
df.pivot_table(index="Sex", columns="Pclass", values="Fare")

Pclass           1          2          3
Sex
female  106.125798  21.970121  16.118810
male     67.226127  19.741782  12.661633

修改aggfunc参数  
查看不同性别乘客的仓位最高票价

In [16]:
df.pivot_table(index="Sex", columns="Pclass", values="Fare", aggfunc="max")

Pclass         1     2      3
Sex
female  512.3292  65.0  69.55
male    512.3292  73.5  69.55

查看不同仓位/性别的乘客的获救比例

In [17]:
df.pivot_table(index="Sex", columns="Pclass", values="Survived")

Pclass         1         2         3
Sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

查看不同仓位/性别的乘客的获救数量

In [18]:
df.pivot_table(index="Sex", columns="Pclass", values="Survived", aggfunc="count")

Pclass    1    2    3
Sex
female   94   76  144
male    122  108  347

查看未成年/成年乘客的获救概率

In [20]:
df['Underaged'] = df['Age'] <= 18   # 新增一列表示是否未成年

In [22]:
df.pivot_table(index='Sex', columns='Underaged', values='Survived')

Underaged     False     True
Sex
female     0.760163  0.676471
male       0.167984  0.338028